** MEETING with Advanced Architecting Class                                     :MEETING:
   :LOGBOOK:
   CLOCK: [2020-10-06 Tue 10:11]--[2020-10-06 Tue 18:01] =>  7:50
   :END:
 [2020-10-06 Tue 10:11]
** DONE Touch base with Anjana about skills matrix for the team
   CLOSED: [2020-05-05 Tue 14:55]
   :LOGBOOK:
   - State "DONE"       from "TODO"       [2020-05-05 Tue 14:55]
   CLOCK: [2020-04-17 Fri 12:56]--[2020-04-17 Fri 12:57] =>  0:01
   Sent email
   :END:
 [2020-04-17 Fri 12:49]
** DONE Check Job ID 1111146 for Art Muthiora
   CLOSED: [2020-04-20 Mon 16:20]
   :LOGBOOK:
   - State "DONE"       from "TODO"       [2020-04-20 Mon 16:20]
   CLOCK: [2020-04-20 Mon 16:11]--[2020-04-20 Mon 16:20] =>  0:09
   :END:
 [2020-04-20 Mon 15:15]
** MEETING with PITT Sales Team meeting                                         :MEETING:
   :LOGBOOK:
   CLOCK: [2020-05-01 Fri 10:00]--[2020-05-01 Fri 10:30] =>  0:30
   :END:
** MEETING with Taryn Marrone weekly meeting                                    :MEETING:
   :LOGBOOK:
   CLOCK: [2020-05-04 Mon 10:00]--[2020-05-04 Mon 11:00] =>  1:00
   :END:
 [2020-05-04 Mon 10:46]
** MEETING with Steve Schmitt RE: Agenda for the week                           :MEETING:
   :LOGBOOK:
   CLOCK: [2020-05-04 Mon 09:00]--[2020-05-04 Mon 10:00] =>  1:00
   :END:
 [2020-05-04 Mon 10:45]
** MEETING with Taryn weekly meeting                                            :MEETING:
   :LOGBOOK:
   CLOCK: [2020-04-27 Mon 10:00]--[2020-04-27 Mon 11:00] =>  1:00
   :END:
 [2020-04-27 Mon 10:12]
** MEETING with SA Interview training                                           :MEETING:
   :LOGBOOK:
   CLOCK: [2020-04-23 Thu 12:01]--[2020-04-23 Thu 14:39] =>  2:38
   :END:
 [2020-04-23 Thu 12:01]
** MEETING with All Hands with Greg Pearson                                     :MEETING:
   :LOGBOOK:
   CLOCK: [2020-05-04 Mon 12:30]--[2020-05-04 Mon 14:00] =>  1:30
   :END:
 [2020-05-04 Mon 13:22]
** MEETING with                                                                 :MEETING:
   :LOGBOOK:
   CLOCK: [2020-05-04 Mon 15:00]--[2020-05-04 Mon 16:30] =>  1:30
   Notes in evaluation app.
   :END:
 [2020-05-04 Mon 14:59]
*** MEETING with Sanjukta AB2                                                   :MEETING:
    :LOGBOOK:
    CLOCK: [2021-02-03 Wed 09:59]--[2021-02-03 Wed 12:02] =>  2:03
    :END:
  [2021-02-03 Wed 09:59]
*** MEETING with Sanjukta RE: AB2                                               :MEETING:
    :LOGBOOK:
    CLOCK: [2021-02-03 Wed 13:44]--[2021-02-03 Wed 14:35] =>  0:51
    :END:
  [2021-02-03 Wed 13:44]
  **
*** MEETING with Conversation with Sanjukta RE: AB2 prep                        :MEETING:
    :LOGBOOK:
    CLOCK: [2021-02-04 Thu 12:12]--[2021-02-04 Thu 12:13] =>  0:01
    :END:
  [2021-02-04 Thu 11:30]
*** MEETING with Sanjukta RE: AB2 #2 dry Run                                    :MEETING:
    :LOGBOOK:
    CLOCK: [2021-02-05 Fri 12:29]--[2021-02-05 Fri 12:59] =>  0:30
    :END:
  [2021-02-05 Fri 12:29]
*** MEETING with Sanjukta AB2                                                   :MEETING:
    :LOGBOOK:
    CLOCK: [2021-02-03 Wed 09:59]--[2021-02-03 Wed 12:02] =>  2:03
    :END:
  [2021-02-03 Wed 09:59]
*** MEETING with Sanjukta RE: AB2                                               :MEETING:
    :LOGBOOK:
    CLOCK: [2021-02-03 Wed 13:44]--[2021-02-03 Wed 14:35] =>  0:51
    :END:
  [2021-02-03 Wed 13:44]
  **
*** MEETING with Conversation with Sanjukta RE: AB2 prep                        :MEETING:
    :LOGBOOK:
    CLOCK: [2021-02-04 Thu 12:12]--[2021-02-04 Thu 12:13] =>  0:01
    :END:
  [2021-02-04 Thu 11:30]
*** MEETING with Sanjukta RE: AB2                                               :MEETING:
    :LOGBOOK:
    CLOCK: [2021-02-08 Mon 09:06]--[2021-02-08 Mon 10:28] =>  1:22
    :END:
  [2021-02-08 Mon 09:00]
** MEETING with Phone Screen for Victor Feinman                                 :MEETING:
   :LOGBOOK:
   CLOCK: [2020-05-19 Tue 09:42]--[2020-05-19 Tue 10:34] =>  0:52
   :END:
 [2020-05-19 Tue 09:42]
** MEETING with Transition meeting with Taryn, Alex C, Anajana, Steve Schmitt   :MEETING:
   :LOGBOOK:
   CLOCK: [2020-05-07 Thu 16:10]--[2020-05-07 Thu 16:54] =>  0:44
** MEETING with Weekly meeting chaired by Taryn Marrone                         :MEETING:
   :LOGBOOK:
   CLOCK: [2020-05-11 Mon 10:00]--[2020-05-11 Mon 11:00] =>  1:00
   :END:
 [2020-05-11 Mon 10:05]
** MEETING with Steve Schmitt RE: account planning                              :MEETING:
   :LOGBOOK:
   CLOCK: [2020-05-11 Mon 09:30]--[2020-05-11 Mon 10:00] =>  0:30
   :END:
 [2020-05-11 Mon 10:03]
** MEETING with Anjana Kandalam RE: Team Meeting                                :MEETING:
   :LOGBOOK:
   CLOCK: [2020-05-12 Tue 13:37]--[2020-05-12 Tue 15:59] =>  2:22
   :END:
 [2020-05-12 Tue 13:37]
** MEETING with Bi-Weekly sales team meeting                                    :MEETING:
   :LOGBOOK:
   CLOCK: [2020-05-29 Fri 10:00]--[2020-05-29 Fri 12:00] =>  2:00
   :END:
 [2020-05-29 Fri 10:17]
** MEETING with Steve Schmitt RE: Agenda for the week                           :MEETING:
   :LOGBOOK:
   CLOCK: [2020-06-08 Mon 09:30]--[2020-06-08 Mon 10:00] =>  0:30
   :END:
 [2020-06-08 Mon 09:37]
** MEETING with Anjana Team Meeting                                             :MEETING:
   :LOGBOOK:
   CLOCK: [2020-06-23 Tue 11:32]--[2020-06-23 Tue 13:04] =>  1:32
   :END:
 [2020-06-23 Tue 11:32]
** MEETING with Team Meeting for Anjana                                         :MEETING:
   :LOGBOOK:
   CLOCK: [2020-07-07 Tue 11:07]--[2020-07-07 Tue 15:12] =>  4:05
   :END:
 [2020-07-07 Tue 11:07]
** MEETING with SA All Hands                                                    :MEETING:
   :LOGBOOK:
   CLOCK: [2020-08-20 Thu 12:00]--[2020-08-20 Thu 13:00] =>  1:00
   :END:
 [2020-08-20 Thu 12:00]
** MEETING with Nick Emmig Check Ride                                           :MEETING:
   :LOGBOOK:
   CLOCK: [2020-08-31 Mon 14:00]--[2020-08-31 Mon 15:31] =>  1:31
   :END:
** MEETING with PENNGF team RE: bi-weekly meeting                               :MEETING:
   :LOGBOOK:
   CLOCK: [2020-05-15 Fri 10:00]--[2020-05-15 Fri 11:00] =>  1:00
   :END:
 [2020-05-15 Fri 10:22]
** MEETING with Weekly meeting with Tara                                        :MEETING:
   :LOGBOOK:
   CLOCK: [2020-06-08 Mon 10:00]--[2020-06-08 Mon 11:00] =>  1:00
   :END:
 [2020-06-08 Mon 10:04]
** MEETING with Steve Schmitt RE: Project Missile                               :MEETING:
   :LOGBOOK:
   CLOCK: [2020-08-20 Thu 10:18]--[2020-08-20 Thu 12:00] =>  1:42
   :END:
 **
 [2020-08-20 Thu 10:18]
** MEETING with Friday Live with Okta                                           :MEETING:
   :LOGBOOK:
   CLOCK: [2020-09-18 Fri 13:00]--[2020-09-18 Fri 13:25] =>  0:25
   :END:
 [2020-09-18 Fri 13:22]
** MEETING with Bi-weekly sales meeting                                         :MEETING:
   :LOGBOOK:
   CLOCK: [2020-09-18 Fri 10:42]--[2020-09-18 Fri 12:28] =>  1:46
   :END:
 [2020-09-18 Fri 13:42]
** MEETING with Field Ready overview                                            :MEETING:
   :LOGBOOK:
   CLOCK: [2020-09-18 Fri 12:30]--[2020-09-18 Fri 13:00] =>  0:30
   :END:
 [2020-09-18 Fri 12:28]
** MEETING with Anajana Team Meeting                                            :MEETING:
   :LOGBOOK:
   CLOCK: [2020-09-22 Tue 11:54]--[2020-09-22 Tue 12:05] =>  0:11
   :END:
 [2020-09-22 Tue 11:00]
** MEETING with Touch base with Anjana                                          :MEETING:
   :LOGBOOK:
   CLOCK: [2020-09-23 Wed 13:00]--[2020-09-23 Wed 14:00] =>  1:00
   :END:
 [2020-09-23 Wed 13:01]
 **
** MEETING with MB1 dry run with Sanjukta                                       :MEETING:
   :LOGBOOK:
   CLOCK: [2020-09-24 Thu 13:36]--[2020-09-24 Thu 15:29] =>  1:53
   :END:
 [2020-09-24 Thu 13:36]
** MEETING with Monthly SA All Hands                                            :MEETING:
   :LOGBOOK:
   CLOCK: [2020-09-25 Fri 13:18]--[2020-09-25 Fri 13:31] =>  0:13
   :END:
 [2020-09-25 Fri 13:00]
** MEETING with Hansencx RE: SFTP                                               :MEETING:
   :LOGBOOK:
   CLOCK: [2020-09-14 Mon 09:58]--[2020-09-14 Mon 11:08] =>  1:10
   :END:
  [2020-09-14 Mon 09:58]--[2020-09-14 Mon 10:45]
** MEETING with Hansencx   Containers Followup (Harish)                         :MEETING:
   :LOGBOOK:
   CLOCK: [2020-09-24 Thu 15:30]--[2020-09-24 Thu 16:15] =>  0:45
   :END:
 [2020-09-24 Thu 15:31]
 **
** MEETING with Taryn Morone RE: Greenfield Weekly Call                         :MEETING:
   :LOGBOOK:
   CLOCK: [2020-09-28 Mon 10:11]--[2020-09-28 Mon 10:45] =>  0:34
   :END:
 [2020-09-28 Mon 10:00]--[2020-09-28 Mon 10:30]
 **
** MEETING with Sanjukta RE: Weekly touch base                                  :MEETING:
   :LOGBOOK:
   CLOCK: [2020-09-28 Mon 14:03]--[2020-09-28 Mon 14:42] =>  0:39
   :END:
 [2020-09-28 Mon 14:03]
** MEETING with Anjana RE: Weekly Team Meeting                                  :MEETING:
   :LOGBOOK:
   CLOCK: [2020-09-29 Tue 11:00]--[2020-09-29 Tue 12:00] =>  1:00
   :END:
 [2020-09-29 Tue 11:22]
** MEETING with Redshift Training session                                       :MEETING:
   :LOGBOOK:
   CLOCK: [2020-09-29 Tue 12:00]--[2020-09-29 Tue 13:09] =>  1:09
   :END:
 [2020-09-29 Tue 12:04]
** MEETING with Anjana RE: One on One                                           :MEETING:
   :LOGBOOK:
   CLOCK: [2020-09-29 Tue 14:00]--[2020-09-29 Tue 14:3≈0] =>  0:30
   :END:
 [2020-09-29 Tue 14:48]
** MEETING with Chris Fuller RE: Sanjukta goals and onboarding                  :MEETING:
   :LOGBOOK:
   CLOCK: [2020-10-01 Thu 10:00]--[2020-10-01 Thu 10:30] =>  0:30
   :END:
 [2020-10-01 Thu 10:44]
** MEETING with Webinar RE: Competing with Azure                                :MEETING:
   :LOGBOOK:
   CLOCK: [2020-10-01 Thu 12:00]--[2020-10-01 Thu 13:00] =>  1:00
   :END:
 [2020-10-01 Thu 12:00]
** MEETING with Bi-Weekly Pittsburgh Sales                                      :MEETING:
   :LOGBOOK:
   CLOCK: [2020-10-02 Fri 10:00]--[2020-10-02 Fri 11:3Brain10!!0] =>  1:30
   :END:
 [2020-10-02 Fri 10:23]
 **
** MEETING with Dry Run #2                                                      :MEETING:
   :LOGBOOK:
   CLOCK: [2020-10-13 Tue 09:03]--[2020-10-13 Tue 10:54] =>  1:51
   :END:
 [2020-10-13 Tue 09:03]
** MEETING with Anjana Team Huddle                                              :MEETING:
   :LOGBOOK:
   CLOCK: [2020-10-13 Tue 11:04]--[2020-10-13 Tue 15:01] =>  3:57
   :END:
 [2020-10-13 Tue 11:04]
 **
** MEETING with Bi-weekly Sales Meeting                                         :MEETING:
   :LOGBOOK:
   CLOCK: [2020-10-16 Fri 11:06]--[2020-10-16 Fri 11:10] =>  0:04
   :END:
 [2020-10-16 Fri 11:06]
** MEETING with Sanjukta AB1                                                    :MEETING:
   :LOGBOOK:
   CLOCK: [2020-11-04 Wed 14:36]--[2020-11-04 Wed 15:41] =>  1:05
   :END:
 [2020-11-04 Wed 14:36]
** MEETING with Sanjukta RE: AB2 prep                                           :MEETING:
   :LOGBOOK:
   CLOCK: [2020-12-23 Wed 11:30]--[2020-12-23 Wed 12:15] =>  0:45
   :END:
 [2020-12-23 Wed 12:52]
** MEETING with Johnson Ngocoral AB2                                            :MEETING:
   :LOGBOOK:
   CLOCK: [2020-12-23 Wed 09:30]--[2020-12-23 Wed 11:00] =>  1:30
   :END:
** MEETING with Justin Piocquid and Mario RE: technical questions               :MEETING:
   :LOGBOOK:
   CLOCK: [2020-12-23 Wed 13:00]--[2020-12-23 Wed 13:45] =>  0:45
   :END:
  [2020-12-23 Wed 13:00]
 **
** MEETING with Johnson - AB2 Dry run                                           :MEETING:
   :LOGBOOK:
   CLOCK: [2020-12-15 Tue 13:46]--[2020-12-16 Wed 10:11] => 20:25
   :END:
** MEETING with Sanjukta AB1 Dry Run #3                                         :MEETING:
   :LOGBOOK:
   CLOCK: [2020-10-21 Wed 13:29]--[2020-10-21 Wed 15:1ccm5] =>  1:46
   :END:
 [2020-10-21 Wed 13:29]
** MEETING with Anjana Team Meeting                                             :MEETING:
   :LOGBOOK:
   CLOCK: [2020-10-27 Tue 11:10]--[2020-10-27 Tue 14:18] =>  3:08
   :END:
 [2020-10-27 Tue 11:10]
** MEETING with VMWare RE: PPG                                                  :MEETING:
   :LOGBOOK:
   CLOCK: [2020-10-29 Thu 10:34]--[2020-10-29 Thu 11:06] =>  0:32
   :END:
 [2020-10-29 Thu 10:34]
 **
** MEETING with AWS Training RE: PrivateLink                                    :MEETING:
   :LOGBOOK:
   CLOCK: [2020-10-29 Thu 12:17]--[2020-10-29 Thu 12:49] =>  0:32

   :END:
 [2020-10-29 Thu 12:17]
 **
** MEETING with Sanjukta RE: Mini AB 1                                          :MEETING:
   :LOGBOOK:
   CLOCK: [2020-12-02 Wed 14:00]--[2020-12-02 Wed 16:13] =>  2:13
   :END:
** MEETING with Hour of Code                                                    :MEETING:
   :LOGBOOK:
   CLOCK: [2020-12-10 Thu 09:47]--[2020-12-10 Thu 09:57] =>  0:10
   :END:
** MEETING with Ashok AB1 - Dry run 1                                           :MEETING:
   :LOGBOOK:
   CLOCK: [2020-12-14 Mon 14:28]--[2020-12-14 Mon 15:42] =>  1:14
   :END:
** MEETING with                                                                 :MEETING:
 [2020-08-12 Wed 14:04]
   :LOGBOOK:
   CLOCK: [2021-01-11 Mon 15:00]--[2021-01-11 Mon 17:15] =>  2:15
   :END:
 [2021-01-11 Mon 15:00]
** MEETING with Hershey RE: Sagemaker and RStudio for Alex Castanedez           :MEETING:
   :LOGBOOK:
   CLOCK: [2021-01-12 Tue 12:31]--[2021-01-12 Tue 14:35] =>  2:04
   :END:
 [2021-01-12 Tue 12:31]
** MEETING with Interview                                                       :MEETING:
   :LOGBOOK:
   CLOCK: [2021-01-15 Fri 11:02]--[2021-01-15 Fri 14:00] =>  2:58
   :END:
 [2021-01-15 Fri 11:02]
** MEETING with Presentation                                                    :MEETING:
   :LOGBOOK:
   CLOCK: [2021-01-15 Fri 14:02]--[2021-01-15 Fri 15:08] =>  1:06
   :END:
 [2021-01-15 Fri 14:02]
** MEETING with Sanjukta RE AB2 Dry Run #2                                      :MEETING:
   :LOGBOOK:
   CLOCK: [2021-01-20 Wed 14:00]--[2021-01-20 Wed 15:34] =>  1:34
   :END:
 [2021-01-20 Wed 14:00]
** MEETING with Sanjukta RE: Ab2 Dry Run #2 review                              :MEETING:
   :LOGBOOK:
   CLOCK: [2021-01-22 Fri 10:30]--[2021-01-22 Fri 11:10] =>  0:40
   :END:
 [2021-01-22 Fri 11:23]
** MEETING with Sanjukta AB2 Dry Run #2                                         :MEETING:
   :LOGBOOK:
   CLOCK: [2021-01-26 Tue 13:01]--[2021-01-26 Tue 14:30] =>  3:13
   :END:
 [2021-01-26 Tue 13:01]
